# Дана длина ребра куба a. Найти объем куба V = a^3 и площадь его поверхности S = 6·a^2.

a = int(input())
V = a ** 3
S = 6 * a ** 2
print(V, S)