# Дана сторона квадрата a. Найти его площадь S = a^2.

a = input()
S = int(a)**2
print(S)