# Дан диаметр окружности d. Найти ее длину L = π·d. В качестве значе- ния π использовать 3.14.

d = input()
L = int(d) * 3.14
print(L)
