# Дана сторона квадрата a. Найти его периметр P = 4·a.
a = input()
P = 4 * int(a)
print (P)
