# Дано целое число A. Проверить истинность высказывания: «Число A является положительным».

a = int(input())
if a > 0:
    print("Yes")
else:
    print("No")
