# Дано целое число. Если оно является положительным, то прибавить к нему 1;
# в противном случае не изменять его. Вывести полученное число.

a = int(input())
if a > 0:
    a += 1
print(a)
